"""
1.  Роздрукувати всі парні числа менші 100 (написати два варіанти коду:
 один використовуючи цикл while, а інший з використанням циклу for).
"""
for i in range(1,100):
	if i%2==0:
 		print(i)

a = 2
while a<100:
	print(a)
	a+=2

###############
"""
2.  Роздрукувати всі непарні числа менші 100. (написати два варіанти коду: 
один використовуючи оператор continue, а інший без цього оператора).
"""
for i in range(100):
	if i%2==1:
 		print(i)


for i in range(100):
	if i%2==0:
		continue
	print(i)

##################
"""
3.  Перевірити чи список містить непарні числа.
          (Підказка: використати оператор break)
"""
a = [12,548,44,12,76]

for element in a:
	if element%2==1:
		print('There are  odd number')
		break
else:
	print('There are no odd number')

##################
"""4.  Створити список, який містить елементи цілочисельного типу, 
потім за допомогою циклу перебору змінити тип даних елементів 
на числа з плаваючою крапкою. 
(Підказка: використати вбудовану функцію float ()).
"""

a = [12,324,45,656,768,34]
b = []
for element in a:
	element = float(element)
	b.append(element)
print(b)

########################
"""
5.Вивести числа Фібоначі включно до введеного числа n,
 використовуючи цикли. (Послідовність 
 чисел Фібоначі 0, 1, 1, 2, 3, 5, 8, 13 і т.д.)
"""
quantity = int(input('Enter a number '))
n1 = 0
n2 = 1
q = 0
while q<quantity:
	print(n1, end=",")
	n3 = n1 + n2
	n1 = n2
	n2 = n3
	q +=1
###################################

"""

6.  Створити список, що складається з чотирьох елементів типу string. 
Потім, за допомогою циклу for, вивести елементи по черзі на екран.
"""
a = ['Hello', 'My', 'Beautifull', 'World']
for element in a:
	print(element)

###############################################

"""7.  Змінити попередню програму так, щоб в кінці кожної букви 
елементів при виводі додавався певний символ, наприклад “#”. 
(Підказка: цикл for може бути вкладений в інший цикл, 
а також  треба використати функцію print(“ ”, end=”%”)).
"""


a = ['Hello', 'My', 'Beautifull', 'World']
for element in a:
	for chapter in element:
		print(chapter, end = "#")
	print(' ',end="\n")
############################################
"""
8.  Юзер вводить число з клавіатури, написати скріпт,
 який визначає чи це число просте чи складне.
"""
a = int(input('Please enter a number '))
sum_1 = 0
for element in range(1,a):
	if a%element == 0:
		sum_1+=1

if sum_1>1:
	print('It is composite number')
else:
	print('It is prime number')
